import React from "react";
import "./Info.css";

export default function TextPayDel() {
    return (
        <div className="pay-delivery-container">
            <div className="pay-delivery-title">Payment & Delivery</div>

            <section className="payment-section">
                <p>
                    <strong>Оплата карткою на сайті</strong>
                </p>
                <p>
                    Ви можете оплатити замовлення онлайн банківською карткою
                    Visa та MasterCard. Оплата за допомогою платіжних карток
                    здійснюється наступним способом:
                </p>
                <ul className="custom-list"> {/* Виправлено тут */}
                    <li>
                        під час оформлення замовлення на сайті Вам буде
                        запропоновано оплату.
                    </li>
                    <li>
                        у графі "Оплата" вам потрібно буде натиснути для сплати.
                    </li>
                    <li>
                        після цього Ви переадресуєтеся на сторінку системи
                        безпечних платежів банку, де Вам необхідно буде
                        підтвердити оплату.
                    </li>
                </ul>
                <p>Ми не працюємо з післясплатою.</p>
                <p>
                    <em>
                        Після оплати поверніться на сторінку вашого замовлення
                        та запам'ятайте номер замовлення, він допоможе вам у
                        разі якщо вам потрібно зв'язатись із нашою підтримкою.
                        Надайте їм номер замовлення та ваше запитання.
                    </em>
                </p>
            </section>

            <section className="delivery-section">
                <p>
                    <strong>
                        Доставка у відділення Нової Пошти по всій Україні
                    </strong>
                </p>

                <p>
                    За допомогою доставки Нової Пошти Ви зможете отримати товар
                    навіть у найвіддаленіших куточках України.
                    <br />В середньому доставка займає{" "}
                    <strong>2-5 днів.</strong>
                    <br />
                    Крім цього, оформлення замовлення може складати{" "}
                    <strong>5-10 днів.</strong>
                    <br />
                    Вартість доставки Нової Пошти до відділення складає{" "}
                    <strong>від 40 грн.</strong> <br />
                    Доставка оплачується під час оформлення замовлення.
                </p>
                <p>
                    Якщо у період до 10 днів у додатку нової пошти не
                    з'являється ваше відправлення, просимо зв'язатись із нашою
                    підтримкою для уточнення деталей.
                </p>

                <p>
                    <strong>Міжнародна доставка</strong>
                </p>
                <p>
                    <strong>
                        Доставка закордон здійснюється за допомогою Укрпошти та
                        Нової Пошти, вартість доставки також оплачується при
                        оформленні замовлення.
                    </strong>
                </p>
                <p>
                    В окремих випадках вартість покупки та доставки може
                    оплачуватись окремо, зверніть увагу на відповідну інформацію
                    при оформленні замовлення.
                </p>
                <p>
                    <strong>
                        {" "}
                        Період оформлення замовлень може складати 10-20 днів.
                        Після оформлення вам надішлють лист на електронну пошту
                        із трекінговим кодом для відстеження (стосується лише
                        міжнародних відправок).
                    </strong>
                </p>
                <p>
                    Відслідковувати ваші відправки потрібно у сервісах Нової
                    Пошти або Укр Пошти, залежно від того яким способом було
                    здійснене відправлення (посилки формату 595******** - Нова
                    Пошта, формату AA********UA - УкрПошта)
                </p>
                <p>Посилання на сервіси для відстеження:</p>
                <ul className="custom-list"> {/* Виправлено тут */}
                    <li>
                        <a
                            href="https://novapost.com/en-ua/"
                            target="_blank"
                            rel="noopener noreferrer"
                        >
                            Новая Пошта
                        </a>
                    </li>
                    <li>
                        <a
                            href="https://track.ukrposhta.ua/tracking_EN.html"
                            target="_blank"
                            rel="noopener noreferrer"
                        >
                            Укрпошта
                        </a>
                    </li>
                </ul>
            </section>
        </div>
    );
}
