import React from "react";
import "./Info.css";

export default function TextPayDel() {
    return (
        <div className="pay-delivery-container">
            <div className="pay-delivery-title">Payment & Delivery</div>

            <section className="payment-section">
                <p>
                    <strong>Оплата карткою на сайті</strong>
                </p>
                <p>
                    Ви можете оплатити замовлення онлайн банківською карткою
                    Visa та MasterCard через PayPal. Оплата за допомогою платіжних карток
                    здійснюється наступним способом:
                </p>
                <ul className="custom-list"> 
                    <li>
                        під час оформлення замовлення на сайті Вам буде
                        запропоновано оплату.
                    </li>
                    <li>
                        у графі "Оплата" вам потрібно буде натиснути для сплати.
                    </li>
                    <li>
                        після цього Ви отримаєте форму
                        безпечних платежів банку, де Вам необхідно буде
                        підтвердити оплату.
                    </li>
                </ul>
                <p>
                    <em>
                        Після оплати поверніться на сторінку вашого замовлення
                        та запам'ятайте номер замовлення, він допоможе вам у
                        разі якщо вам потрібно зв'язатись із нашою підтримкою.
                        Надайте їм номер замовлення та ваше запитання.
                    </em>
                </p>
            </section>

            <section className="delivery-section">
                <p>
                    <strong>
                        Доставка у відділення Нової Пошти по всій Україні
                    </strong>
                </p>

                <p>
                    За допомогою доставки Нової Пошти Ви зможете отримати товар
                    навіть у найвіддаленіших куточках України.
                    <br />В середньому доставка займає{" "}
                    <strong>2-5 днів.</strong>
                    <br />
                    Крім цього, оформлення замовлення може складати{" "}
                    <strong>5-10 днів.</strong>
                    <br />
                    Вартість доставки Нової Пошти до відділення складає{" "}
                    <strong>від 40 грн.</strong> <br />
                    Доставка оплачується нами під час оформлення замовлення.
                </p>
                <p>
                    Якщо у період до 10 днів у додатку нової пошти не
                    з'являється ваше відправлення, просимо зв'язатись із нашою
                    підтримкою для уточнення деталей.
                </p>

               
                <p>
                    Відслідковувати ваші відправки потрібно у сервісах Нової
                    Пошти(посилки формату 595******** - Нова
                    Пошта)
                </p>
                <p>Посилання на сервіси для відстеження:</p>
                <ul className="custom-list"> 
                    <li>
                        <a
                            href="https://novapost.com/en-ua/"
                            target="_blank"
                            rel="noopener noreferrer"
                        >
                            Новая Пошта
                        </a>
                    </li>
                   
                </ul>
            </section>
        </div>
    );
}
